docs/tutorials/collections.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-29 Tue 15:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tutorial: Collections</title>
<meta name="author" content="Connor Redfern" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../modulus-style.css" type="text/css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Tutorial: Collections</h1>
<div style="text-align:right">
<p>
<a href="../index.html">Modulus</a> / <a href="index.html">Tutorials</a> / Projects
</p>
</div>



<div id="outline-container-org6fc394a" class="outline-2">
<h2 id="org6fc394a">Types and Arrays</h2>
<div class="outline-text-2" id="text-org6fc394a">
<p>
Modulus is what is known as a statically typed language. A type is like a
category of values - for example, <code>Integer</code> is the type of values which are
whole numbers. An equally common type is <code>String</code>, which is a sequence of
Characters. For example, "hello" and "my name is chris" are both
Strings. Modulus uses types to catch errors before you run your program. As an
example, suppose you write <code>pi + 2</code>, expecting <code>pi</code> to hold the value
<code>3.14159...</code>. However, someone decided to set it to the string "pi". In this
case, Modulus will report a <i>type error</i>, because + both inputs to have the type
<code>Integer</code>, but you gave it a <code>String</code>.
</p>




<p>
Modulus also allows you to group data together into structures called <i>arrays</i>,
which you can thing of as a collection of values. Arrays are written as a list
of values between 'tortoise' brackets <code>⦗⦘</code>, (these have codes <code>;[​[</code> and <code>;]​]</code>,
or <code>:left-tortoise</code> and <code>:right-tortoise</code>). For example, the array containing the
numbers 1, 2 and 3 is written <code>⦗1 2 3⦘</code>.
</p>



<p>
It's cool to be able to make an array, but what can we <i>do</i> with them? For a
start, we can join them together with <i>append</i>, (also written `⋅' (<code>;**</code>)).
</p>

<div class="org-src-container">
<pre class="src src-modulus">&gt; <span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span><span style="color: #807f96;">&#10648;</span> &#8901; <span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">4</span> <span style="color: #cea2ca;">5</span> <span style="color: #cea2ca;">6</span><span style="color: #807f96;">&#10648;</span>
<span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span> <span style="color: #cea2ca;">4</span> <span style="color: #cea2ca;">5</span> <span style="color: #cea2ca;">6</span><span style="color: #807f96;">&#10648;</span>
&gt; append <span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span><span style="color: #807f96;">&#10648;</span> <span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">4</span> <span style="color: #cea2ca;">5</span> <span style="color: #cea2ca;">6</span><span style="color: #807f96;">&#10648;</span>
<span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span> <span style="color: #cea2ca;">4</span> <span style="color: #cea2ca;">5</span> <span style="color: #cea2ca;">6</span><span style="color: #807f96;">&#10648;</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orgc8410cb" class="outline-2">
<h2 id="orgc8410cb">Higher-Order Functions</h2>
<div class="outline-text-2" id="text-orgc8410cb">
<div class="org-src-container">
<pre class="src src-modulus">&gt; <span style="color: #738FD7;">defn</span> add1 <span style="color: #807f96;">[</span>x<span style="color: #807f96;">]</span> <span style="color: #807f96;">(</span>x + <span style="color: #cea2ca;">1</span><span style="color: #807f96;">)</span>
&gt; map add1 <span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span><span style="color: #807f96;">&#10648;</span>
<span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span> <span style="color: #cea2ca;">4</span><span style="color: #807f96;">&#10648;</span>
</pre>
</div>

<pre class="example">
&gt; map (+ 1) ⦗1 2 3⦘
⦗2 3 4⦘
</pre>

<pre class="example">
&gt; (+ 1) ¨ ⦗1 2 3⦘
⦗2 3 4⦘
</pre>

<div class="org-src-container">
<pre class="src src-modulus">&gt; <span style="color: #738FD7;">defn</span> add <span style="color: #807f96;">[</span>x y<span style="color: #807f96;">]</span> <span style="color: #807f96;">(</span>x + y<span style="color: #807f96;">)</span>
&gt; fold add <span style="color: #cea2ca;">0</span> <span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span><span style="color: #807f96;">&#10648;</span>
<span style="color: #cea2ca;">6</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-modulus">&gt; foldl <span style="color: #807f96;">(</span>+<span style="color: #807f96;">)</span> <span style="color: #cea2ca;">0</span> <span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span><span style="color: #807f96;">&#10648;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-modulus">&gt; <span style="color: #807f96;">(</span><span style="color: #9d81ba;">(</span>+<span style="color: #9d81ba;">)</span> / <span style="color: #cea2ca;">0</span><span style="color: #807f96;">)</span> <span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span><span style="color: #807f96;">&#10648;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-modulus">&gt; <span style="color: #807f96;">(</span>+ / <span style="color: #cea2ca;">0</span><span style="color: #807f96;">)</span> <span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span><span style="color: #807f96;">&#10648;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-modulus">&gt; + <span style="color: #807f96;">&#10216;</span>/ <span style="color: #cea2ca;">0</span><span style="color: #807f96;">&#10217;</span> <span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span><span style="color: #807f96;">&#10648;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb9f0635" class="outline-2">
<h2 id="orgb9f0635">Useful Array functions</h2>
<div class="outline-text-2" id="text-orgb9f0635">
<p>
filter
</p>

<div class="org-src-container">
<pre class="src src-modulus">&gt; even? n &#8796; <span style="color: #807f96;">(</span>n | <span style="color: #cea2ca;">2</span> = <span style="color: #cea2ca;">0</span><span style="color: #807f96;">)</span>
<span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span><span style="color: #807f96;">&#10648;</span> <span style="color: #807f96;">&#10216;</span>&#9673; ,<span style="color: #807f96;">&#10217;</span> <span style="color: #807f96;">&#10647;</span><span style="color: #d24b83;">&#8278;a</span> <span style="color: #d24b83;">&#8278;b</span> <span style="color: #d24b83;">&#8278;c</span><span style="color: #807f96;">&#10648;</span>
&gt; <span style="color: #807f96;">&#10647;</span><span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #d24b83;">&#8278;a</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #d24b83;">&#8278;b</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #d24b83;">&#8278;c</span><span style="color: #9d81ba;">&#10648;</span>
   <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">2</span> <span style="color: #d24b83;">&#8278;a</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">2</span> <span style="color: #d24b83;">&#8278;b</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">2</span> <span style="color: #d24b83;">&#8278;c</span><span style="color: #9d81ba;">&#10648;</span>
   <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">3</span> <span style="color: #d24b83;">&#8278;a</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">3</span> <span style="color: #d24b83;">&#8278;b</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">3</span> <span style="color: #d24b83;">&#8278;c</span><span style="color: #9d81ba;">&#10648;</span><span style="color: #807f96;">&#10648;</span>
</pre>
</div>

<p>
filter
</p>

<div class="org-src-container">
<pre class="src src-modulus"><span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span><span style="color: #807f96;">&#10648;</span> <span style="color: #807f96;">&#10216;</span>&#9673; ,<span style="color: #807f96;">&#10217;</span> <span style="color: #807f96;">&#10647;</span><span style="color: #d24b83;">&#8278;a</span> <span style="color: #d24b83;">&#8278;b</span> <span style="color: #d24b83;">&#8278;c</span><span style="color: #807f96;">&#10648;</span>
&gt; <span style="color: #807f96;">&#10647;</span><span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #d24b83;">&#8278;a</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #d24b83;">&#8278;b</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #d24b83;">&#8278;c</span><span style="color: #9d81ba;">&#10648;</span>
   <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">2</span> <span style="color: #d24b83;">&#8278;a</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">2</span> <span style="color: #d24b83;">&#8278;b</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">2</span> <span style="color: #d24b83;">&#8278;c</span><span style="color: #9d81ba;">&#10648;</span>
   <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">3</span> <span style="color: #d24b83;">&#8278;a</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">3</span> <span style="color: #d24b83;">&#8278;b</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">3</span> <span style="color: #d24b83;">&#8278;c</span><span style="color: #9d81ba;">&#10648;</span><span style="color: #807f96;">&#10648;</span>
</pre>
</div>

<p>
inner-product
</p>

<div class="org-src-container">
<pre class="src src-modulus">&gt; <span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span><span style="color: #807f96;">&#10648;</span> <span style="color: #807f96;">&#10216;</span>&#8857; ,<span style="color: #807f96;">&#10217;</span> <span style="color: #807f96;">&#10647;</span><span style="color: #d24b83;">&#8278;a</span> <span style="color: #d24b83;">&#8278;b</span> <span style="color: #d24b83;">&#8278;c</span><span style="color: #807f96;">&#10648;</span>
<span style="color: #807f96;">&#10647;</span><span style="color: #9d81ba;">(</span><span style="color: #cea2ca;">1</span>, <span style="color: #d24b83;">&#8278;a</span><span style="color: #9d81ba;">)</span> <span style="color: #9d81ba;">(</span><span style="color: #cea2ca;">2</span>, <span style="color: #d24b83;">&#8278;b</span><span style="color: #9d81ba;">)</span> <span style="color: #9d81ba;">(</span><span style="color: #cea2ca;">3</span>, <span style="color: #d24b83;">&#8278;c</span><span style="color: #9d81ba;">)</span><span style="color: #807f96;">&#10648;</span>
</pre>
</div>

<p>
outer-product
</p>

<div class="org-src-container">
<pre class="src src-modulus"><span style="color: #807f96;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #cea2ca;">2</span> <span style="color: #cea2ca;">3</span><span style="color: #807f96;">&#10648;</span> <span style="color: #807f96;">&#10216;</span>&#9673; ,<span style="color: #807f96;">&#10217;</span> <span style="color: #807f96;">&#10647;</span><span style="color: #d24b83;">&#8278;a</span> <span style="color: #d24b83;">&#8278;b</span> <span style="color: #d24b83;">&#8278;c</span><span style="color: #807f96;">&#10648;</span>
&gt; <span style="color: #807f96;">&#10647;</span><span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #d24b83;">&#8278;a</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #d24b83;">&#8278;b</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">1</span> <span style="color: #d24b83;">&#8278;c</span><span style="color: #9d81ba;">&#10648;</span>
   <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">2</span> <span style="color: #d24b83;">&#8278;a</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">2</span> <span style="color: #d24b83;">&#8278;b</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">2</span> <span style="color: #d24b83;">&#8278;c</span><span style="color: #9d81ba;">&#10648;</span>
   <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">3</span> <span style="color: #d24b83;">&#8278;a</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">3</span> <span style="color: #d24b83;">&#8278;b</span><span style="color: #9d81ba;">&#10648;</span> <span style="color: #9d81ba;">&#10647;</span><span style="color: #cea2ca;">3</span> <span style="color: #d24b83;">&#8278;c</span><span style="color: #9d81ba;">&#10648;</span><span style="color: #807f96;">&#10648;</span>
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
